import { Button, Typography } from "@mui/material";
import React from "react";

function Info() {
  return (
    <div id='info_wrapper'>
      <img className='info_img' src='page.jpg' alt='info' />
      <div className='text_part'>
        <div className='info_text'>
          <Typography component='h3' variant='h4'>
            Докосни се до красотата на растително дъбената кожа
          </Typography>
          <Typography component='h2' variant='h5'>
            Добре дошли в Leathersthetic, където красотата на ръчно изработената
            естествена кожа оживява! Това, което започна като любопитство, скоро
            се превърна в дълбока страст и любимо хоби.
            <br />
            <br />
            През своето пътешествие в света на кожарството открих вродената
            красота на растително дъбената кожа и отделих безброй часове за
            осъвършенстване на уменията си и овладяване на изкуството на работа
            с този ценен материал. Всяко изделие, всеки шев и процес на стареене
            станаха възможност за създаване на нещо наистина изключително.
            <br />
            <br />
            Името "Leathersthetic" представлява сближаването на естествената
            кожа и естетиката, присъщи на този занаят. Моята мисия е да донеса
            привлекателността на ръчно изработената кожа в ръцете и джобовете на
            хора, които ценят красотата на естествените материали. Всеки
            аксесоар е изработен, за да пасне според нуждите и да покаже
            уникалните характеристики и красивото остаряване на кожата, които се
            развиват с времето, като разказва историята на своя носител.
          </Typography>
        </div>

        <Button className='learn_more_btn' variant='contained'>
          научи повече
        </Button>
      </div>
    </div>
  );
}

export default Info;
