import { Typography } from "@mui/material";
import React from "react";

function PrivacyAndPolicy() {
  return (
    <div className='privacy_terms_wrapper'>
      <Typography variant='h4' component={"h2"}>
        Политика за поверителност
      </Typography>
      <div className='policy'>
        <Typography variant='h6' component={"h4"}>
          1. Въведение
        </Typography>
        <Typography component={"p"}>
          Тази Политика за поверителност описва как събираме, използваме и
          защитаваме вашата лична информация в съответствие с Регламент (ЕС)
          2016/679 (Общ регламент за защита на данните - GDPR). Моля, прочетете
          внимателно тази политика, за да разберете как третираме вашата лична
          информация.
        </Typography>
      </div>
      <div className='policy'>
        <Typography variant='h6' component={"h4"}>
          2. Събиране на информация
        </Typography>
        <Typography component={"p"}>
          Събираме следните видове лична информация:
          <br />
          <br />
          Лични данни: Име, адрес на електронна поща, телефонен номер и друга
          информация, която предоставяте при регистрация или използване на нашия
          сайт. Данни за използване: Информация за вашето устройство и начина,
          по който използвате нашия сайт, включително IP адрес, тип на браузъра,
          посетени страници и времето, прекарано на тях.
        </Typography>
      </div>
      <div className='policy'>
        <Typography variant='h6' component={"h4"}>
          3. Използване на информацията Използваме вашата информация за следните
          цели:
        </Typography>
        <Typography component={"p"}>
          Не продаваме, не търгуваме и не прехвърляме вашата лична информация на
          трети страни, освен ако това не е необходимо за изпълнението на
          услуга, която сте заявили, или ако законът го изисква.
        </Typography>
      </div>
      <div className='policy'>
        <Typography variant='h6' component={"h4"}>
          4. Споделяне на информация
        </Typography>
        <Typography component={"p"}>
          Тази Политика за поверителност описва как събираме, използваме и
          защитаваме вашата лична информация в съответствие с Регламент (ЕС)
          2016/679 (Общ регламент за защита на данните - GDPR). Моля, прочетете
          внимателно тази политика, за да разберете как третираме вашата лична
          информация.
        </Typography>
      </div>
      <div className='policy'>
        <Typography variant='h6' component={"h4"}>
          5. Вашите права
        </Typography>
        <Typography component={"p"}>
          Съгласно GDPR, вие имате следните права:
          <br />
          <br />
          Право на достъп: Да получите копие от вашата лична информация, която
          съхраняваме. Право на коригиране: Да поискате коригиране на неточна
          или непълна информация. Право на изтриване: Да поискате изтриване на
          вашата лична информация. Право на ограничаване на обработката: Да
          ограничите обработката на вашата информация при определени условия.
          Право на преносимост: Да получите вашите лични данни в структуриран,
          широко използван и машинно четим формат. Право на възражение: Да
          възразите срещу обработката на вашите данни. 6. Сигурност Приемаме
          всички необходими технически и организационни мерки, за да защитим
          вашата лична информация от неоторизиран достъп, промяна, разкриване
          или унищожаване.
        </Typography>
      </div>
      <div className='policy'>
        <Typography variant='h6' component={"h4"}>
          7. Бисквитки
        </Typography>
        <Typography component={"p"}>
          Използваме бисквитки, за да подобрим вашето потребителско изживяване
          на нашия сайт. Можете да настроите вашия браузър да отказва
          бисквитките или да ви предупреждава, когато бисквитките се изпращат.
        </Typography>
      </div>
      <div className='policy'>
        <Typography variant='h6' component={"h4"}>
          8. Промени в Политиката за поверителност
        </Typography>
        <Typography component={"p"}>
          Можем периодично да актуализираме тази Политика за поверителност.
          Всички промени ще бъдат публикувани на тази страница и ще бъдат
          ефективни от датата на публикуване.
        </Typography>
      </div>
      <div className='company_details'>
        <Typography variant='h6' component={"h5"}>
          Кейс Брандинг ЕООД с ЕИК 205259197
        </Typography>
        <Typography variant='h6' component={"h5"}>
          Имейл: info@leathersthetic.com
        </Typography>
        <Typography variant='h6' component={"h5"}>
          Телефон: 0876404445
        </Typography>
      </div>
    </div>
  );
}

export default PrivacyAndPolicy;
