import { Typography } from "@mui/material";
import React from "react";

function TermsAndConditions() {
  return (
    <div className='privacy_terms_wrapper'>
      <Typography variant='h4' component={"h2"}>
        Общи условия за ползване на сайта
      </Typography>
      <div className='policy'>
        <Typography variant='h6' component={"h3"}>
          Въведение
        </Typography>
        <Typography component={"p"}>
          Тези Общи условия уреждат достъпа и използването на нашия уебсайт.
          Моля, прочетете внимателно тези условия преди да използвате нашия
          уебсайт. С достъпа или използването на сайта, вие се съгласявате да
          спазвате тези условия.
        </Typography>
      </div>
      <div className='policy'>
        <Typography variant='h6' component={"h3"}>
          Дефиниции
        </Typography>
        <Typography component={"p"}>
          <strong>Сайт:</strong> Уебсайтът, който управляваме и на който се
          продават кожени изделия.
          <br />
          <br />
          <strong>Потребител:</strong> Всяко лице, което използва сайта. <br />
          <br />
          <strong>Продукти:</strong> Кожени изделия, които се предлагат за
          продажба на сайта. Достъп и използване на сайта.
          <br />
          <br />
          <strong>Достъп:</strong> Достъпът до сайта е разрешен временно и си
          запазваме правото да оттеглим или променим услугите, които
          предоставяме на сайта без предизвестие. <br />
          <br />
          <strong>Използване:</strong> Потребителите трябва да използват сайта
          само за законни цели и в съответствие с тези Общи условия. <br />
          <br />
          <strong>Процес на регистрация:</strong> За да направите поръчка, може
          да бъде необходимо да създадете акаунт. При регистрация трябва да
          предоставите точна и пълна информация. <br />
          <br />
          <strong>Отговорност:</strong> Вие сте отговорни за запазването на
          конфиденциалността на информацията за вашия акаунт и парола и за
          всички действия, извършени под вашия акаунт. <br />
          <br />
          <strong>Приемане на поръчки:</strong> Всички поръчки са предмет на
          нашето приемане и наличността на продуктите. <br />
          <br />
          <strong>Цени и плащане:</strong> Всички цени са в лева и включват ДДС,
          освен ако не е указано друго. Плащанията се извършват чрез посочените
          методи на плащане на сайта. <br />
          <br />
          <strong>Доставка:</strong> Продуктите се доставят в рамките на 10
          работни дни чрез Еконт. Разходите за доставка са за сметка на клиента.
          <br />
          <br />
          <strong>Връщане:</strong> Можете да върнете продуктите в рамките на 14
          дни от датата на получаване, при условие че те са в оригиналното си
          състояние и опаковка. Персонализираните продукти не подлежат на
          връщане.
          <br />
          <br />
          <strong>Поверителност:</strong> Личните данни, предоставени от
          потребителите, се обработват в съответствие с нашата Политика за
          поверителност. <br />
          <br />
          <strong>Бисквитки:</strong> Сайтът използва бисквитки. За повече
          информация, моля, прочетете нашата Политика за бисквитки. <br />
          <br />
          <strong>Няма гаранция:</strong> Сайтът се предоставя "както е" и ние
          не даваме гаранции относно точността или пълнотата на съдържанието на
          сайта. <br />
          <br />
          <strong>Отговорност:</strong> Ние не носим отговорност за преки или
          косвени щети, произтичащи от използването или невъзможността за
          използване на сайта. Промени в Общите условия Запазваме правото да
          променяме тези Общи условия по всяко време. Всяка промяна ще бъде
          публикувана на тази страница и ще влезе в сила от датата на
          публикуването й.
        </Typography>
      </div>

      <div className='policy'>
        <Typography variant='h6' component={"h4"}>
          Контакти
        </Typography>
        <Typography component={"p"}>
          Ако имате въпроси или нужда от допълнителна информация относно нашата
          политика за доставка и връщане, моля, свържете се с нас на
          info@leathersthetic.com или на следния телефон: 0876404445.
        </Typography>
      </div>
      <div className='company_details'>
        <Typography variant='h6' component={"h5"}>
          Благодарим ви, че използвате нашия сайт!
        </Typography>
      </div>
    </div>
  );
}

export default TermsAndConditions;
