import React from "react";

function About() {
  return (
    <div id='about_wrapper'>
      <div id='about_image_wrapper'>
        <img src='about.jpg' alt='' />
      </div>
      <div id='about_info_wrapper'>
        <img src='mini-logo.png' alt='' />
        <p>
          <span>Добре дошли в Leathersthetic!</span>
          Аз съм Ивайло, и за мен е удоволствие да ви разкажа за моята страст
          към изработването на кожени изделия. На 26 години съм и се занимавам с
          този неповторим занаят вече 3 години, като започнах през 2021-ва.
          Самообучавайки се, открих в себе си огромно удовлетворение от това да
          създавам неща с ръцете си, а свързването на тази страст с
          привлекателността и разнообразието на растително дъбената кожа беше
          естествен избор за мен.
          <br />
          <br />
          Идеята зад Leathersthetic е да споделя тази неповторима красота и
          гъвкавост на естествената качествена кожа с възможно най-много хора.
          Избрал съм да работя точно с растително дъбена кожа, защото се
          обработва натурално и буквално може да надживее целия живот на своя
          собственик, заменяйки необходимостта от честа смяна на продукти.
          Нейната уникалност идва от процеса на обработка, при който се
          използват естествени растителни съставки, като дъбова кора. Тези
          съставки правят кожата да попие по различен начин, водейки до различни
          нюанси, текстури и оттенъци.
          <br />
          <br />
          Поради тази индивидуалност в производствения процес, не се получават
          две еднакви парчета растително дъбена кожа. Това прави всяко парче
          специално само по себе си. Ръчната изработка също добавя стойност,
          защото включва индивидуално внимание към детайлите, специфични
          занаятчийски умения и персонален подход, които придават на всеки
          продукт неповторим характер и качество. Моята мисия не е просто да
          продавам кожени изделия, а да намеря начини да намаля
          свръхконсуматорството и да предложа нещо ценно, което ще служи с
          години, а не се износва лесно.
          <br />
          <br />
          Кожата, с която работя, отнема много повече време за производство от
          другите видове кожа, затова е по-скъпа, но същевременно е
          по-качествена, устойчива и не вреди на околната среда, което също е
          важно за мен. Само 10% от кожените изделия в света са направени от
          растително дъбена кожа, и в този сайт ще намериш само от такъв вид,
          като имаш възможност да притежаваш нещо наистина уникално и ценно и да
          подкрепиш ръчното производство и малкия български бизнес.
        </p>
      </div>
    </div>
  );
}

export default About;
